[
  {
    "title": "MYC - Carta 3D CSS",
    "description": "Descubre cómo dar vida a tus proyectos con solo HTML y CSS al crear un impresionante efecto 3D al pasar el cursor sobre una carta. ¡Haz clic aquí para aprender más y darle un toque especial a tus diseños!",
    "url": "carta-3d-css",
    "image": "https://i.imgur.com/txQzjog.png"
  },
  {
    "title": "MYC - i18n Básico React",
    "description": "Aprende a utilizar i18n en tus aplicación de React para que estas obtengan un mayor alcance teniendo la propiedad de poseer múltiples lenguajes. ¡Haz click aquí y aprende como!",
    "url": "i18n-basico-react",
    "image": "https://i.imgur.com/HLMBdrv.png"
  },
  {
    "title": "MYC - Etiquetas meta:og y favicons",
    "description": "Etiquetas meta básicas para incrementar el SEO de tu sitio web. Y una forma sencilla de como generar tus favicons facil y rapido. ¡Haz click aquí para ver más!",
    "url": "etiquetas-meta",
    "image": "https://i.imgur.com/VpQdObN.png"
  },
  {
    "title": "MYC - Patrón de diseño: Singleton",
    "description": "Un patrón de diseño que permite restringir la creación de objetos pertenecientes a una clase o el valor de un tipo a un único objeto. ¡Aprende singleton!",
    "url": "pd-singleton",
    "image": "https://i.imgur.com/x1BDrEz.png"
  },
  {
    "title": "MYC - Patrón de diseño: Factory",
    "description": "El patrón factory consiste en utilizar una clase constructora abstracta con unos cuantos métodos definidos y otro abstracto. ¡Click aquí para ver!",
    "url": "pd-factory",
    "image": "https://i.imgur.com/mnma9M5.png"
  },
  {
    "title": "MYC - Patrón de diseño: Abstract Factory",
    "description": "Abstract Factory es un patrón de diseño creacional que resuelve el problema de crear familias enteras de productos sin especificar sus clases concretas. ¡Ver aquí!",
    "url": "pd-abstract-factory",
    "image": "https://i.imgur.com/F5ffBQF.png"
  },
  {
    "title": "MYC - Patrón de diseño: Prototype",
    "description": "El patrón de diseño prototipo tiene como finalidad crear nuevos objetos clonando una instancia creada previamente. Para aprenderlo haz click aquí.",
    "url": "pd-prototype",
    "image": "https://i.imgur.com/vfqqXfr.png"
  },
  {
    "title": "MYC - Patrón de diseño: Facade",
    "description": "El patrón de diseño facade está motivado por la necesidad de estructurar un entorno de programación y reducir su complejidad con la división en subsistemas, minimizando las comunicaciones y dependencias entre estos.",
    "url": "pd-facade",
    "image": "https://i.imgur.com/GmDH1Xz.png"
  },
  {
    "title": "MYC - Corazón palpitante CSS",
    "description": "En este artículo podrás aprender a hacer un efecto muy sencillo pero atractivo, se trata de un corazón el cual posee una animación de pulsación. ¡Haz click para ver más!",
    "url": "corazon-css",
    "image": "https://i.imgur.com/3bZdWyx.png"
  },
  {
    "title": "MYC - Patrón de diseño: Decorator",
    "description": "Nos permite no tener que crear sucesivas clases que hereden de la primera incorporando la nueva funcionalidad, sino otras que la implementan y se asocian a la primera.",
    "url": "pd-decorator",
    "image": "https://i.imgur.com/WFV99Ml.png"
  },
  {
    "title": "MYC - Patrón de diseño: Proxy",
    "description": "El patrón Proxy es un patrón estructural que tiene como propósito proporcionar un subrogado o intermediario de un objeto para controlar su acceso. ¡Click para ver más!",
    "url": "pd-proxy",
    "image": "https://i.imgur.com/POtV7XZ.png"
  },
  {
    "title": "MYC - Angular vs React: ¿Cuándo y porqué?",
    "description": "Si eres un desarrollador FrontEnd, de seguro ya has oído sobre Angular y React, pero, ¿sabes sus diferencias, pros y contras? En este artículo te lo explicaremos.",
    "url": "angular-vs-react",
    "image": "https://i.imgur.com/7pB4AMD.png"
  }
]
